src/test/resources/fifth/stress-testing.txt
 siege -b -c10 -t60S http://localhost:8080/suppliers\?sortDirection\=asc

 Lifting the server siege...
 Transactions:                   4915 hits
 Availability:                 100.00 %
 Elapsed time:                  59.72 secs
 Data transferred:             446.13 MB
 Response time:                  0.12 secs
 Transaction rate:              82.30 trans/sec
 Throughput:                     7.47 MB/sec
 Concurrency:                    9.95
 Successful transactions:        4916
 Failed transactions:               0
 Longest transaction:            1.16
 Shortest transaction:           0.05



------------


ab -n 100 -c 10 http://localhost:8080/suppliers\?sortDirection\=asc
 This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
 Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
 Licensed to The Apache Software Foundation, http://www.apache.org/

 Benchmarking localhost (be patient).....done


 Server Software:
 Server Hostname:        localhost
 Server Port:            8080

 Document Path:          /suppliers?sortDirection=asc
 Document Length:        95159 bytes

 Concurrency Level:      10
 Time taken for tests:   1.208 seconds
 Complete requests:      100
 Failed requests:        0
 Total transferred:      9526400 bytes
 HTML transferred:       9515900 bytes
 Requests per second:    82.77 [#/sec] (mean)
 Time per request:       120.812 [ms] (mean)
 Time per request:       12.081 [ms] (mean, across all concurrent requests)
 Transfer rate:          7700.52 [Kbytes/sec] received

 Connection Times (ms)
               min  mean[+/-sd] median   max
 Connect:        0    0   0.2      0       1
 Processing:    76  109  14.1    109     141
 Waiting:       74  107  14.1    107     139
 Total:         76  109  14.2    109     141

 Percentage of the requests served within a certain time (ms)
   50%    109
   66%    115
   75%    118
   80%    122
   90%    127
   95%    134
   98%    139
   99%    141
  100%    141 (longest request)